# FamilyInstanceCreationData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstanceCreationData Class
Members See Also
---
A class which wraps the arguments of FamilyInstance for batch creation.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyInstanceCreationData
```

Visual Basic
---
```text
Public Class FamilyInstanceCreationData
```

Visual C++
---
```text
public ref class FamilyInstanceCreationData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.Creation..::..FamilyInstanceCreationData
# See Also
FamilyInstanceCreationData Members
Autodesk.Revit.Creation Namespace